---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CoverTypeName
source: html/378be074-6fd6-5078-eee5-64d37ca50584.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CoverTypeName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId CoverTypeName { get; }
```